Revit 2027 API
Railing.ResetSupportPosition Method
 Resets the continuous rails support subelements position data.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetSupportPosition()
Public Sub ResetSupportPosition
public:
void ResetSupportPosition()
member ResetSupportPosition : unit -> unit
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace